Repository: januariocosta84/onlineretail-live
Catalog: locale/*/LC_MESSAGES/django.po
Languages: tt

source: New arrival
tt: Foin tama

source: Flash Deals / SalesOn !!!
tt: Vendas

source: Discount or Promotion
tt: Diskontus no Promosaun Sira

source: Search by product
tt: Buka tuir produto nia naran

source: Search
tt: buka

source: Sign in
tt: Login

source: Sign up
tt: Rejista

source: Categories
tt: Kategoria

source: All
tt: Hotu

source: Busines & Services
tt: Servisu i Busines

source: Trade shows
tt: Komersiu

source: Services
tt: Servisu

source: Get the app
tt: Hetan nia app

source: Select Languages
tt: Hili Lian

source: Timor News
tt: Notisias Timor

source: Timor Employeement
tt: Timor Empregu

source: Public Information
tt: Informasaun Publika

source: Education
tt: Edukasaun

source: Tourism
tt: Turismo
